Tekla Open API Reference for Tekla Structures 2025
Matrix.Multiply Operator (Matrix, IEnumerable<Point>)
 Transforms the given points using the given matrix.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static IEnumerable<Point> operator *(
	Matrix A,
	IEnumerable<Point> Points
)
Public Shared Operator * (
	A As Matrix,
	Points As IEnumerable(Of Point)
) As IEnumerable(Of Point)
Parameters
A
Type: Tekla.Structures.Geometry3d.Matrix
The transformation matrix.
Points
Type: System.Collections.Generic.IEnumerable<Point>
The points to be transformed.
Return Value
Type: IEnumerable<Point>
The new transformed points.
See Also
Reference
Matrix Class
Multiply Overload
Tekla.Structures.Geometry3d Namespace